ConnectTest/src/Enums/СтатусыСообщений/СтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщений</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/ИнтеграцияСRapporto/Module.bsl
Функция ОтправитьСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт, Параметры.Пользователь, Параметры.Пароль,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL	= "world_class?msisdn=" + Параметры.НомерТелефона + "&message=" + Параметры.Текст;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	Попытка
		ТестовоеЧисло	= Число(ТелоЗапроса);
		Ответ.Вставить("ИД", ТелоЗапроса);
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.Отправлено);		
	Исключение
		Ответ.Вставить("Ошибка", ТелоЗапроса);		
	КонецПопытки;
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция ПроверитьСтатусСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт, Параметры.Пользователь, Параметры.Пароль,, Параметры.Таймаут, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.ИспользоватьАутентификациюОС);	
	
	URL	= "world_class/delivery_report?mt_num=" + Параметры.ИД + "&show_date=Y";
	ЗапросHTTP	= Новый HTTPЗапрос(URL);	
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	МассивСтрок	= СтрРазделить(ТелоЗапроса, " ");
	
	Ответ.Вставить("Период", УниверсальноеВремя(ТекущаяДата()));
	
	Если МассивСтрок.Количество() = 1 Тогда
		Статус	= СтатусСообщения(МассивСтрок[0]);
		Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.СтатусыСообщений") Тогда
			Ответ.Вставить("СтатусСообщения", Статус);
		Иначе
			Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.НеДоставлено);
			Ответ.Вставить("Ошибка",ТелоЗапроса);
		КонецЕсли;	
	ИначеЕсли МассивСтрок.Количество() = 2 Тогда
		Статус	= СтатусСообщения(МассивСтрок[0]);
		Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.СтатусыСообщений") Тогда
			Ответ.Вставить("СтатусСообщения", Статус);
		Иначе
			Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.НеДоставлено);
			Ответ.Вставить("Ошибка",ТелоЗапроса);
		КонецЕсли;
		Ответ.Вставить("Период", Дата(МассивСтрок[1]));
	Иначе
		Ответ.Вставить("СтатусСообщения", Перечисления.СтатусыСообщений.НеДоставлено);		
		Ответ.Вставить("Ошибка",ТелоЗапроса);
	КонецЕсли;	
	
	Возврат Ответ;	
	
КонецФункции

Функция СтатусСообщения(КодСтатуса)
	Если КодСтатуса = "-1" Тогда
		Возврат Перечисления.СтатусыСообщений.НеОтправлено;
	ИначеЕсли КодСтатуса = "0" Тогда
		Возврат Перечисления.СтатусыСообщений.НеДоставлено;
	ИначеЕсли КодСтатуса = "1" Тогда
		Возврат Перечисления.СтатусыСообщений.НеДоставлено;
	ИначеЕсли КодСтатуса = "2" Тогда
		Возврат Перечисления.СтатусыСообщений.Отправлено;
	ИначеЕсли КодСтатуса = "3" Тогда
		Возврат Перечисления.СтатусыСообщений.Доставлено;
	Иначе
		Возврат КодСтатуса;
	КонецЕсли;
КонецФункции
